Tests/XCP/xcp_performance.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16KiB each
2MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      6607.55
    writes/s:                     4405.20
    fsyncs/s:                     14144.79

Throughput:
    read, MiB/s:                  103.24
    written, MiB/s:               68.83

General statistics:
    total time:                          10.0031s
    total number of events:              251229

Latency (ms):
         min:                                    0.00
         avg:                                    0.16
         max:                                   31.68
         95th percentile:                        0.67
         sum:                                39460.57

Threads fairness:
    events (avg/stddev):           62807.2500/3717.65
    execution time (avg/stddev):   9.8651/0.01